src/TrB_conf/src/InformationRegisters/TrBGeneralInformationNATS/TrBGeneralInformationNATS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TrBGeneralInformationNATS</name>
  <comment>Основная информация NATS</comment>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>server_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/TrB_conf/src/InformationRegisters/TrBGeneralInformationNATS/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записать данные.
// 
// Параметры:
//  Метрики - Соответствие из КлючИЗначение:
//   * Ключ - Строка - метрика
//   * Значение - Строка, Число - значение метрики
//
Процедура ЗаписатьДанные(Метрики) Экспорт
	Server_id = Метрики["server_id"];
	Если server_id = Неопределено Тогда
		ВызватьИсключение "Не указан обязательный параметр server_id";
	КонецЕсли;
	
	Для Каждого Метрика Из Метрики Цикл
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.server_id = Server_id;
		МенеджерЗаписи.Ключ = Метрика.Ключ;
		МенеджерЗаписи.Значение = Метрика.Значение;
		
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
